app/controllers/cities_controller.rb

  def create
    @city = City.create(city_params)
---
INSERT INTO "cities" ("name", "country", "picture", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "sf"], ["country", "usa"], ["picture", ""], ["created_at", 2016-10-27 05:05:51 UTC], ["updated_at", 2016-10-27 05:05:51 UTC], ["slug", "sf"]]

  def show
    @city = City.friendly.find(params[:id])
    @post = Post.new
    @posts = City.friendly.find(params[:id]).posts.order(created_at: :desc)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1 ORDER BY "posts"."created_at" DESC  [["city_id", 2]]

  def edit
    @city = City.friendly.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
     @city = City.friendly.find(params[:id])
     @city.update_attributes(city_params)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cities" SET "name" = $1, "updated_at" = $2 WHERE "cities"."id" = $3  [["name", "Shire"], ["updated_at", 2016-10-27 05:22:40 UTC], ["id", 1]]

  def destroy
    City.friendly.find(params[:id]).destroy
---
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 8]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]