app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @post = Post.find(params[:post_id])
    @city = City.friendly.find(params[:city_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def create
    @post = Post.find(params[:post_id])
    @comment = @post
              .comments
              .new(comment_params)

    @comment.user_id = current_user.id
    @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "I'm Gandalf and I'm awesome."], ["user_id", 1], ["post_id", 1], ["created_at", 2016-10-26 19:13:54 UTC], ["updated_at", 2016-10-26 19:13:54 UTC]]

  def edit
    @post = Post.find(params[:post_id])
    @city = City.friendly.find(params[:city_id])
    @comment = Comment.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.update_attributes(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "I'm Gandalf and I'm a wizard."], ["updated_at", 2016-10-26 21:05:40 UTC], ["id", 1]]