app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @posts = User.friendly.find(current_user.id).posts

INSERT INTO "posts" ("title", "content", "city_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Bilbo's House"], ["content", "Watch your head"], ["city_id", 1], ["user_id", 1], ["created_at", 2016-10-26 19:12:54 UTC], ["updated_at", 2016-10-26 19:12:54 UTC]]
---
  def create
    @post = City.friendly.find(params[:city_id])
            .posts
            .new(post_params)

    @post.user_id = current_user.id
    @post.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
  def show
    @user = User.friendly.find(current_user.id)
    @city = City.friendly.find(get_city(params[:id]))
    @comments = Comment.where(post_id: params[:id])

UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "Watch your head, dummy!"], ["updated_at", 2016-10-26 21:02:05 UTC], ["id", 1]]
---
  def update
    @post.update_attributes(post_params)