app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
     @user.picture != "" ? @user.picture : @user.picture = "http://www.collecttolkien.com/images/Stickers/Sticker%20LOTR%20Middle-Earth.jpg"
    if @user.save
---
INSERT INTO "users" ("name", "current_city", "email", "password_digest", "picture", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "users" SET "picture" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["picture", "http://www.collecttolkien.com/images/Stickers/Sticker%20LOTR%20Middle-Earth.jpg"], ["updated_at", 2016-10-27 00:15:55 UTC], ["id", 1]]

  def show
    if current_user.id == params[:id]
       @user = User.friendly.find(params[:id])
       @posts = Post.where(user_id: current_user.id).order(created_at: :desc)
     else
       @user = User.friendly.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Legolas Elf"], ["password_digest", "$2a$10$GJ7XBnUuA.WskWm33Kwsyez4qCVZghbkQz4cg9cWZtvmNKSX9.xru"], ["updated_at", 2016-10-26 23:06:00 UTC], ["id", 2]]

  def set_user
     @user = User.friendly.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]